<template>
	<view class="emoji">
		<view class="emoji-item" v-for="(item,i1) in emoji" :key="i1" @click="clickPhiz(item)">
			{{item}}
		</view>
	</view>
</template>

<script>
	export default {
		name: "emoji",
		data() {
			return {
				emoji: [
					'😀', '😁', '😂', '🤣', '😃', '😄', '😆', '😉',
					'😊', '😋', '😎', '😍', '😘', '😗', '😙', '😚',
					'️😏️️', '🙂', '🤗', '🤔', '😐', '😑', '😶', '🙄',
					'😏', '😣', '😥', '😮', '🤐', '😯', '😪', '😫',
					'😴', '😌', '😛', '😜', '😝', '🤤', '😒', '😓',
					'😔', '😕', '🙃', '🤑', '😲', '😞', '🙁', '😖',
					'😟', '😤', '😢', '😭', '😦', '😧', '😨', '😩',
					'😬', '😰', '😱', '😳', '😵', '😡', '😠', '😷',
					'🤒', '🤕', '🤢', '🤧', '😇', '🤠', '🤡', '🤥',
					'🤓', '😈', '👿', '👹', '👺', '💀', '👻', '👽',
					'🤖', '💩', '😺', '😸', '😹', '😻', '😼', '😽',
					'🙀', '😿', '😾', '🗣', '👤', '👥', '👫', '👬',
					'👭', '', '', '', '', '', '', '',
					'', '', '', '', '', '', '', '',
					'', '', '', '', '', '', '', '',
				]
			};
		},
		methods: {
			clickPhiz(e) {
				this.$emit('emoji', e)
			}
		}
	}
</script>

<style lang="scss">
	.emoji {
		display: flex;
		width: 100%;
		flex-wrap: wrap;
		padding: 0 10px;
		font-size: 21px;
		text-align: center;
		justify-content: start;
		max-height: 160px;
		overflow: hidden;
		overflow-y: auto;

		.emoji-item {
			padding: 2px;
		}
	}
</style>
